package io_IO;

/* ФОРМАТИРОВАНИЕ
 * - Formatting API: собирает данные в форматированный вид
 *      - для потока битов: PrintStream
 *          - System.out и System.err, вероятно, единственные 2 объекта этого типа, с которыми
 *          нужно будет работать
 *      - для потока символов: PrintWriter
 *          - обычно используется этот класс
 *      - print/println: форматирование единичных значений стандартным способом
 *      - format: форматирование почти любого количества значений на основе форматной строки
 *
 * */

public class FormattingApi {
}
