package lang_comments_documenting;

/* Начинаются со знака @*/


/*
 * @author - Обозначает автора программы
 * @deprecated - Указывает на то, что элемент программы не рекомендован к применению
 * @exceptions - Обозначает исключение, генерируемое методом
 * @param - Документирует параметр метода
 * @return - Документирует значение, возвращаемое методом
 * @see - Указывает ссылку на другую тему
 * @serial - Документирует поле, упорядочиваемое по умолчанию
 * @serialData - Документирует данные, записываемые методом writeObject() или writeExternal()
 * @serialField - Документирует компонент ObjectStreamField
 * @since - Обозначает версию, в которой были внесены определенные изменения
 * @throws - То же, что и дескриптор @exceptions
 * @version - Обозначает версию класса*/

public class Autonomous {
}
