package lang_comments_documenting;

/* Начинаются с фигурной скобки
*
* Могут применяться в других дескрипторах.*/


/*
* {@code} - Отображает данные шрифтом, предназначенным для вывода исходного кода, не выполняя
* преобразований в формат HTML-документа
*
* {@docRoot} Указывает путь к корневому каталогу документации
*
* {@inheritDoc} Наследует комментарии от ближайшего суперкласса
*
* {@link} Вставляет ссылку на другую тему
*
* {@linkplain} Вставляет ссылку на другую тему, но ссылка отображается тем же шрифтом, что и простой
* текст
*
* {@literal} Отображает данные, не выполняя преобразований в формат HTML-документа
*
* {@value} Отображает значение константы, которая должна быть определена как поле типа static*/

public class BuiltIn {
}
