package types_references_classes;

import java.io.Serializable;

/*ОБЪЯВЛЕНИЕ
 * - модификатор доступа:
 *      - 1 публичный класс в файле
 *
 * - имя класса с большой буквы (по конвенции)
 *      - имя файла должно совпадать с именем публичного класса
 *
 * - если есть, суперкласс после слова extends
 *
 * - если есть, список имлементируемых методов
 *
 * - тело в фигурных скобках*/


/* КЛАСС ВЕРХНЕГО УРОВНЯ НЕ МОЖЕТ БЫТЬ СТАТИЧЕСКИМ */
public class Declaration extends Object implements Serializable {
}