package _lang_spaces;

/* Необходимы для разделения лексем компилятором */

public class Main {

    /*Минимум 1 пробел между всеми лексемами, которые не разграничены оператором или разделителем*/
    public              static int    min1SpaceBetweenLexems= -      45+4;


    /*ВАРИАНТЫ РАЗДЕЛИТЕЛЕЙ*/
    int space; // простой пробел
    int     tab; // табуляция
    int
    df;// новая строка


                                    /*Нет правил в отношении отступов*/
                int                  noPaddingRules; //

}
