package algorithms_datastructures.algorithms.sort;

/* ОБЩЕЕ
 * - устойчивая/неустойчивая сортировка:
 *      - устойчивая: сохраняет порядок равных элементов
 *          - удобно для сортировки по разным критериям
 *              - напр. сначала сортируется по году - выбраны элементы только по году, затем по рейтингу -
 *              сначала будут идти лучшие по рейтингу, при этом выше среди них будут те, кто раньше по году
 *          - обычно требует дополнительную память и время
 *          - предпочтительней, т.к. в любом случае ничего не портит
 *      - неустойчивая: меняет порядок
 *
 * - алгоритмы сортировки IN-PLACE: сортировка массива без использования дополнительной памяти (или
 * ее константное количество)
 *
 * - стратегия divide and conquer:
 *      - важная парадигма при разработке алгоритмов
 *      - крупная задача рекурсивно разбивается на мелкие подзадачи того же типа, пока они не станут
 *      элементарными, а затем их решения комбинируются для получения ответа к исходной задаче */



public class Main {
}
